INSERT INTO Passenger (passenger_id, last_name, first_name, middle_name, document, information, email, phone_number) VALUES
(98, 'Щепина', 'Екатерина', 'Андреевна', 'паспорт', '9222457389', 'vedma@mail.com', '89274783467'),
(16, 'Никитин', 'Алексей', 'Владимирович', 'паспорт', '3692581477', 'nikitin.aleksey@icloud.com', '89374673461'),
(99, 'Зотина', 'Вероника', 'Константиновна', 'заграничный паспорт', '723774859', 'ronni@yandex.ru', '89994783404'),
(2, 'Иванов', 'Дмитрий', 'Евгеньевич', 'паспорт', '84924573154', 'ivanov.dmitriy@example.com', '89134779870'),
(3, 'Смирнова ', 'Ольга', NULL, 'вид на жительство в РФ', '821345223', 'smi@mail.com', '8341669823'),
(4, 'Соколова', 'Анна', 'Ивановна', 'паспорт', '3692581479', 'anna@example.com', '81234772345'),
(5, 'Шабалин', 'Илья', 'Сергеевич', 'паспорт', '9217363478', 'shaba@example.com', '89867158666'),
(6, 'Шаммедова', 'Самира', NULL, 'паспорт',' 9218345123', 'samirka2003@example.com', '89173662378'),
(7, 'Калабанов', 'Степан', 'Вячеславович', 'паспорт', '9221678399', 'stepan@example.com', '89174552371'),
(8, 'Кит', 'Светослав', 'Дмитриевич', 'заграничный паспорт', '722774119', 'svet@example.com', '89903471233'),
(9, 'Дьяконова', 'Лидия', 'Евгеньевна', 'паспорт', '9113845123', 'lidada0101@example.com', '89173669999'),
(10, 'Петров', 'Олег', 'Евгеньевич', 'паспорт', '922242698', 'oleja2004@example.com', '89994522312'),
(11, 'Шарифзянова', 'Зиля', 'Рифкатовна', 'паспорт', '9867123456', 'she2004@example.com', '89004581209'),
(12, 'Чесноков', 'Дмитрий', 'Дмитриевич', 'паспорт', '91233991221', 'choir@example.com', '89274891221'),
(13, 'Кокорина', 'Дарья', 'Олеговна', 'паспорт', '9779199004', 'darkoko@example.com', '89926471298');


INSERT INTO Station (station_id, name) VALUES
(1, 'Самара'),
(2, 'Калиниград-Пассажирский (Южный вокзал)'),
(3, 'Пермь 2'),
(4, 'Сочи'),
(5, 'Нижний Новгород Московский (Московский вокзал)'),
(6, 'Минеральные воды'),
(7, 'Санкт-Петербург-Главный (Московский вокзал)'),
(8, 'Набережные Челны'),
(9, 'Ижевск'),
(10, 'Казань-Пассажирская'),
(11, 'Москва Казанская (Казанский вокзал)'),
(12, 'Москва Октябрьская (Ленинградский вокзал)'),
(13, 'Уфа'),
(14, 'Екатеринбург-Пассажирский'),
(15, 'Новосибирск-Главный');


INSERT INTO Route (route_id, timetable_id, departure_name, arrrival_name) VALUES
(22, 1, 'Уфа', 'Казань'),
(23, 2, 'Пермь', 'Ижевск'), 
(24, 3, 'Набережные Челны', 'Сочи'),
(25, 4, 'Москва', 'Пермь'),
(26, 5, 'Екатеринбург', 'Пермь'),
(27, 6, 'Новосибирск', 'Москва'),
(28, 7, 'Москва', 'Санкт-Петербург'),
(29, 8, 'Казань', 'Набережные Челны'),
(30, 9, 'Уфа', 'Минеральные воды'),
(31, 10, 'Нижний Новгород', 'Набережные Челны'),
(32, 11, 'Москва', 'Самара'),
(33, 12, 'Самара', 'Уфа'),
(34, 13, 'Калининград', 'Москва'),
(35, 14, 'Минеральные воды', 'Уфа'),
(36, 15, 'Санкт-Петербург', 'Самара');


